---
kind: property
id: P:Autodesk.Revit.DB.Analysis.ConceptualConstructionType.MassSurfaceSubCategoryId
source: html/7ab3f987-cb65-4c2f-0f9f-e0f74e29416d.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualConstructionType.MassSurfaceSubCategoryId Property

The surface type subcategory element id associated with the ConceptualConstructionType.

## Syntax (C#)
```csharp
public ElementId MassSurfaceSubCategoryId { get; }
```